## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_lambda_code_signing_config.app_lambda_code_signing_config` |
|        | `aws_signer_signing_profile.app_lambda_signing_profile`         |
| update | `aws_lambda_function.vault_data_integrity_check`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_code_signing_config.app_lambda_code_signing_config will be created
  + resource "aws_lambda_code_signing_config" "app_lambda_code_signing_config" {
      + arn           = (known after apply)
      + config_id     = (known after apply)
      + id            = (known after apply)
      + last_modified = (known after apply)

      + allowed_publishers {
          + signing_profile_version_arns = (known after apply)
        }

      + policies {
          + untrusted_artifact_on_deployment = "Enforce"
        }
    }

  # aws_lambda_function.vault_data_integrity_check will be updated in-place
  ~ resource "aws_lambda_function" "vault_data_integrity_check" {
      + code_signing_config_arn        = (known after apply)
        id                             = "VaultDataIntegrityCheck"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_signer_signing_profile.app_lambda_signing_profile will be created
  + resource "aws_signer_signing_profile" "app_lambda_signing_profile" {
      + arn                   = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + name_prefix           = "AppLambdaSigningProfile"
      + platform_display_name = (known after apply)
      + platform_id           = "AWSLambda-SHA384-ECDSA"
      + revocation_record     = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)
      + version_arn           = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_data_integrity_check"]
WARN - plan.json - main - Missing Common Tags: ["aws_signer_signing_profile.app_lambda_signing_profile"]

30 tests, 17 passed, 13 warnings, 0 failures, 0 exceptions

```

</details>
